a, b, с = (1, 'sd', True)
print(a)
li = [(1, 'a'), (2, 'b'), (3, 'c')]
dc = dict(li)
print(dc)

al = {'А', 'а', 'Б', 'б', 'В', 'в', 'Г', 'г', 'Д', 'д', 'Е', 'е', 'Ё', 'ё', 'Ж', 'ж', 'З', 'з', 'И', 'и', 'Й', 'й', 'К', 'к', 'Л', 
      'л', 'М', 'м', 'Н', 'н', 'О', 'о', 'П', 'п', 'Р', 'р', 'С', 'с', 'Т', 'т', 'У', 'у', 'Ф', 'ф', 'Х', 'х', 'Ц', 'ц', 'Ч', 'ч', 
      'Ш', 'ш', 'Щ', 'щ', 'Ъ', 'ъ', 'Ы', 'ы', 'Ь', 'ь', 'Э', 'э', 'Ю', 'ю', 'Я', 'я'}

d = 'Словари в языке Python'
e = 'использование функции dict()'
f = 'del: удаляет из словаря элемент с заданным ключом.'
g = set(d)&set(e)&set(f)&al
print(g)
