a = [' ', 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 
    'A', 'A0', 'A1', 'A2', 'A3', 'A4', 'A5', 'A6', 'A7', 'A8', 'A9',
    'B', 'B0', 'B1', 'B2', 'B3', 'B4', 'B5', 'B6', 'B7', 'B8', 'B9', 
    'C', 'C0', 'C1', 'C2', 'C3', 'C4', 'C5', 'C6', 'C7', 'C8', 'C9',
    'D', 'D0', 'D1', 'D2', 'D3', 'D4', 'D5', 'D6', 'D7', 'D8', 'D9',
    'E', 'E0', 'E1', 'E2', 'E3', 'E4', 'E5', 'E6', 'E7', 'E8', 'E9',
    'F', 'F0', 'F1', 'F2', 'F3', 'F4', 'F5', 'F6', 'F7', 'F8', 'F9',
    'G', 'G0', 'G1', 'G2', 'G3', 'G4', 'G5', 'G6', 'G7', 'G8', 'G9',
    'H', 'H0', 'H1', 'H2', 'H3', 'H4', 'H5', 'H6', 'H7', 'H8', 'H9',
    'I', 'I0', 'I1', 'I2', 'I3', 'I4', 'I5', 'I6', 'I7', 'I8', 'I9',
    'J', 'J0', 'J1', 'J2', 'J3', 'J4', 'J5', 'J6', 'J7', 'J8', 'J9',]
b = [' ', 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 
    'A', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',
    'B', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', 
    'C', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',
    'D', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',
    'E', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',
    'F', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',
    'G', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',
    'H', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',
    'I', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',
    'J', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',]
while 1 < 2:
    print('Координаты очередного хода: ')
    try:
        c = input()
        d = a.index(c)
    except ValueError:
        print('Неверный ввод! Пример ходов - A5, D1, H9')
        continue
    if b[d]=='X':
        print('Эта ячейка занята, повторный ход: ')
        continue
    b[d] = 'X'
    for i in range(0,100,11):
        print(' '.join(str(x) for x in b[i:11+i]))
    if b[d-1] == 'X' and b[d+1] == 'X':
        print('Вы проиграли!')
        break
    elif b[d-1] == 'X' and b[d-2] == 'X':
        print('Вы проиграли!')
        break
    elif b[d+1] == 'X' and b[d+2] == 'X':
        print('вы проиграли!')
        break
    elif b[d-11] == 'X' and b[d+11] == 'X':
        print('Вы проиграли!')
        break
    elif b[d-11] == 'X' and b[d-22] == 'X':
        print('Вы проиграли!')
        break
    elif b[d+11] == 'X' and b[d+22] == 'X':
        print('Вы проиграли!')
        break
    elif b[d-12] == 'X' and b[d+12] == 'X':
        print('Вы проиграли!')
        break
    elif b[d-12] == 'X' and b[d-24] == 'X':
        print('Вы проиграли!')
        break
    elif b[d+12] == 'X' and b[d+24] == 'X':
        print('Вы проиграли!')
        break
    elif b[d-10] == 'X' and b[d+10] == 'X':
        print('Вы проиграли!')
        break
    elif b[d-10] == 'X' and b[d-20] == 'X':
        print('Вы проиграли!')
        break
    elif b[d+10] == 'X' and b[d+20] == 'X':
        print('Вы проиграли! (┬┬﹏┬┬)')
        break

# Если не разделять на несколько строк то код будет выглядит так

a = [' ', 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 'A', 'A0', 'A1', 'A2', 'A3', 'A4', 'A5', 'A6', 'A7', 'A8', 'A9', 'B', 'B0', 'B1', 'B2', 'B3', 'B4', 'B5', 'B6', 'B7', 'B8', 'B9', 'C', 'C0', 'C1', 'C2', 'C3', 'C4', 'C5', 'C6', 'C7', 'C8', 'C9', 'D', 'D0', 'D1', 'D2', 'D3', 'D4', 'D5', 'D6', 'D7', 'D8', 'D9', 'E', 'E0', 'E1', 'E2', 'E3', 'E4', 'E5', 'E6', 'E7', 'E8', 'E9', 'F', 'F0', 'F1', 'F2', 'F3', 'F4', 'F5', 'F6', 'F7', 'F8', 'F9', 'G', 'G0', 'G1', 'G2', 'G3', 'G4', 'G5', 'G6', 'G7', 'G8', 'G9', 'H', 'H0', 'H1', 'H2', 'H3', 'H4', 'H5', 'H6', 'H7', 'H8', 'H9', 'I', 'I0', 'I1', 'I2', 'I3', 'I4', 'I5', 'I6', 'I7', 'I8', 'I9', 'J', 'J0', 'J1', 'J2', 'J3', 'J4', 'J5', 'J6', 'J7', 'J8', 'J9',]
b = [' ', 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 'A', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', 'B', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', 'C', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', 'D', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', 'E', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', 'F', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', 'G', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', 'H', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', 'I', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', 'J', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',]
while 1 < 2:
    print('Координаты очередного хода: ')
    try:
        c = input()
        d = a.index(c)
        if b[d]=='X':
            print('Эта ячейка занята, повторный ход: ')
            continue
        b[d] = 'X'
        for i in range(0,100,11):
            print(' '.join(str(x) for x in b[i:11+i]))
        if b[d-1] == 'X' and b[d+1] == 'X' or b[d-1] == 'X' and b[d-2] == 'X' or b[d+1] == 'X' and b[d+2] == 'X' or b[d-11] == 'X' and b[d+11] == 'X' or (b[d-11] == 'X' and b[d-22] == 'X') or b[d+11] == 'X' and b[d+22] == 'X' or b[d-12] == 'X' and b[d+12] or b[d-12] == 'X' and b[d-24] == 'X' or b[d+12] == 'X' and b[d+24] == 'X' or b[d-10] == 'X' and b[d+10] == 'X' or b[d-10] == 'X' and b[d-20] == 'X' or b[d+10] == 'X' and b[d+20] == 'X':
            print('Вы проиграли! (┬┬﹏┬┬)')
            break
    except (ValueError, IndexError):
        print('Неверный ввод! Пример ходов - A5; D1; H9')
        continue
